# Equality Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryObject..::..Equality Operator
GeometryObject Class See Also
---
Determines whether two GeometryObjects are the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator ==(
	GeometryObject first,
	GeometryObject second
)
```

Visual Basic
---
```text
Public Shared Operator = ( _
	first As GeometryObject, _
	second As GeometryObject _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator ==(
	GeometryObject^ first,
	GeometryObject^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..GeometryObjectThe first GeometryObject.
second
    Type: Autodesk.Revit.DB..::..GeometryObjectThe second GeometryObject.
# ### Return Value
True if the GeometryObjects are the same; otherwise, false.
# Remarks
This compares the internal identifiers of the geometry, and doesn't compare them geometrically.
# See Also
GeometryObject Class
Autodesk.Revit.DB Namespace